{
  "backend/main.mo": "Main actor defining Patient type with Gender enum, CRUD operations (add, update, delete, get, getAllSorted), auto-generated registration numbers (year/counter format), and migration support.",
  "backend/migration.mo": "Migration module that transforms OldPatient records (firstName, lastName, birthdate, registrationNumber) to NewPatient records by adding gender, address, and phoneNumber fields with default values.",
  "feature_evidence.json": "Feature evidence report documenting three implemented features: password authentication prompt (020202), patient edit functionality, and patient delete functionality, all with high confidence.",
  "frontend-file-summaries.txt": "JSON-formatted summaries of 15 frontend files including main app, registration form, history tab, PWA configuration, service worker, authentication modal, edit modal, and delete confirmation dialog.",
  "frontend/index.css": "Tailwind CSS configuration with OKLCH color system defining light and dark theme variables including cyan primary colors, background, foreground, and component-specific tokens.",
  "frontend/index.html": "HTML entry point with PWA meta tags (theme-color #06b6d4, manifest link, apple-touch-icon) and root div for React mounting.",
  "frontend/public/manifest.json": "PWA manifest defining The Dental Doc app metadata with cyan theme (#06b6d4), standalone display mode, and icon references for 192x192 and 512x512 sizes.",
  "frontend/public/sw.js": "Service worker implementing cache-first strategy for static assets with install, activate, and fetch event handlers for offline PWA functionality.",
  "frontend/src/App.tsx": "Main app component with cyan-themed header, tab navigation between patient registration and history views, QueryClient provider, ThemeProvider, and comprehensive footer with clinic/doctor information.",
  "frontend/src/components/DeleteConfirmationDialog.tsx": "AlertDialog component displaying delete confirmation with patient name, warning message, and cancel/delete action buttons styled with red destructive theme.",
  "frontend/src/components/PasswordPromptModal.tsx": "A modal dialog component that prompts for password authentication (hardcoded as '020202') before allowing sensitive actions to proceed, with error handling and form validation.",
  "frontend/src/components/PatientEditModal.tsx": "A modal dialog for editing patient information with form validation, parsing patient data from a JSON birthdate field, and preventing changes to the registration number.",
  "frontend/src/components/PatientHistoryTab.tsx": "Displays a searchable list of all patients with edit and delete functionality, requiring password authentication before modifications and parsing patient data from JSON birthdate fields.",
  "frontend/src/components/PatientRegistrationForm.tsx": "A form component for registering new patients with validation, storing patient data as JSON in the birthdate field, and automatically generating a printable PDF upon successful registration.",
  "frontend/src/hooks/useActor.ts": "Custom React hook that manages the backend actor instance based on Internet Identity authentication state, creating authenticated or anonymous actors and invalidating dependent queries on identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context and hooks for login/logout functionality, managing AuthClient creation, identity persistence, and authentication status throughout the application.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for patient CRUD operations (add, update, delete, get, getAll) that interact with the backend actor and manage query cache invalidation.",
  "frontend/src/index.css": "Tailwind CSS configuration file defining CSS custom properties for light and dark themes, including color variables for UI components (sidebar, charts, borders, etc.) using OKLCH color space, and base styles for body and border elements.",
  "frontend/src/main.tsx": "React application entry point that sets up the root render with QueryClientProvider for data fetching, InternetIdentityProvider for authentication, and imports the main App component and global styles.",
  "frontend/src/utils/pdfGenerator.ts": "Utility function that generates a printable patient case paper PDF by opening a new window with HTML content including cyan header with clinic name, patient details, blank lines for clinical notes, and footer with clinic and doctor information.",
  "frontend/tailwind.config.js": "Tailwind configuration extending the default theme with custom color schemes using OKLCH color space (including sidebar, chart, and cyan palette), container settings, border radius variables, custom shadows, and accordion animations.",
  "project_state.json": "Project metadata describing an Android mobile dental clinic app with patient database management, automated registration numbers, PDF generation for case papers, PWA support, and authentication for record editing (password: 020202), with a known issue of PDF footer positioning."
}